Tekla Open API Reference for Tekla Structures 2025
StructuresDialogAttribute Methods
The StructuresDialogAttribute type exposes the following members.
Methods
Name | Description
GetCorrectDialogAttributeType
 Initializes a new StructuresDialogAttribute instance.
ToString
 Returns a string that represents the current StructuresDialogAttribute object.
 (Overrides Object.ToString().)
Top
See Also
Reference
StructuresDialogAttribute Class
Tekla.Structures.Dialog Namespace